> diff_element(c("a", "b", "c", "d"), c("a", "b"), width = 10)
x vs y
  "a"
  "b"
+ "c"
+ "d"

> diff_element(c("a", "b"), c("a", "b", "c", "d"), width = 10)
x vs y
  "a"
  "b"
- "c"
- "d"

> diff_element(c("a", "B", "C", "d"), c("a", "b", "c", "d"), width = 10)
x vs y
  "a"
- "b"
+ "B"
- "c"
+ "C"
  "d"

> # context
> diff_element(c(letters, "a", "b"), c(letters, "a", "b", "c"), width = 10)
x[26:28] vs y[26:29]
  "y"
  "z"
  "a"
  "b"
- "c"

