> # extra y
> compare(list("a", "b"), list("a", "b", "c"))
`old` is length 2
`new` is length 3

`old[[3]]` is absent
`new[[3]]` is a character vector ('c')

> compare(list(a = "a", b = "b"), list(a = "a", b = "b", c = "c"))
`old` is length 2
`new` is length 3

`names(old)`: "a" "b"    
`names(new)`: "a" "b" "c"

`old$c` is absent
`new$c` is a character vector ('c')

> # extra x
> compare(list("a", "b", "c"), list("a", "b"))
`old` is length 3
`new` is length 2

`old[[3]]` is a character vector ('c')
`new[[3]]` is absent

> compare(list(a = "a", b = "b", c = "c"), list(a = "a", b = "b"))
`old` is length 3
`new` is length 2

`names(old)`: "a" "b" "c"
`names(new)`: "a" "b"    

`old$c` is a character vector ('c')
`new$c` is absent

> # different order
> compare(list(a = "a", b = "b"), list(b = "b", a = "a"))
`names(old)`: "a" "b"    
`names(new)`:     "b" "a"

> # invalid names uses position
> compare(list(a = "a", "b"), list(a = "a", "c"))
`old[[2]]`: "b"
`new[[2]]`: "c"

> compare(list(a = "a", a = "b"), list(a = "a", a = "c"))
`old[[2]]`: "b"
`new[[2]]`: "c"

